[
  {
    "id": "11758",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: I thought more about the word. It's everywhere. Often not even beeped out of television shows, \"bitch\" is in rap songs and pop songs and on t-shirts. \"It's Britney, bitch.\" \"I'm in Miami, bitch.\" He’s not what he seems to be in the beginning. And I that's something Lynn Shelton and I really wanted to be on the same Online dating taught me more about myself than it did about men. Yoga feels good. But practicing yoga on a board in the middle of a bay or in the ocean is simply delightful. MK: What level are you at? My parents are in the medical profession too. My dad’s a doctor and my mom is a professor of pediatric"
  },
  {
    "id": "11962",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The congresswoman called his actions \"painful + eroding to American society.\" The congresswoman called upon the public to stand against politicians \"who sit in ivory towers thinking up new wars to wage.\" The congresswoman slammed Meadows' for not offering Lynne Patton time to speak during the Cohen hearing. The actress called it a way to “further my own knowledge of Jewish and Israeli history,” vowing to speak out “against the insidious and anti-Semitic BDS movement.” The 2020 Democratic candidate is using the president's reported interest in acquiring the island to fundraise for his own campaign."
  },
  {
    "id": "1129",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: MR: Garland, your albums Ghost Writer, which earned you a Best New Artist nod from Rolling Stone, plus the Lou Reed/Rumour MR: Are there a couple of tracks on the project that went beyond expectations for you and/or the group? TL: Quite a few, for A Conversation with Todd Rundgren Mike Ragogna: Todd, many are saying your new release White Knight is a return to the musical Buffy's new new album Power In The Blood starts off with the remake of your classic \"It's My Way.\" By kicking off the album with this track, was she making a statement about her creative approach this time out? A Conversation with Joe Scarborough Mike Ragogna: Joe, your new album is called “Welcome To The Monkey House.” What an appropriate"
  },
  {
    "id": "11234",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: It seems like prosecutors accidentally pasted text into the wrong document and filed it. The president signed a document on live TV, but didn't say what's in it. One 16-year-old filed a complaint alleging that a Border Patrol agent \"threw him down and smashed his head into the ground with his boot.\" People have chalked things like \"Deport them all\" and \"Build that wall\" in public spaces. Star players like Andre Iguodala and Roger Federer rely on rest to perform their best on game day."
  },
  {
    "id": "11365",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Dr. Samantha Decombel says her invitation to give a lecture was revoked due to her pregnancy. Katrina Bolduc was determined to make motherhood work with her athletic dreams. Raelin Scurry was on the way to the hospital when she delivered her son. A mom is honoring her daughter's father, who passed away before she was born. Hayley Booth shared a lovely tribute to her daughter's \"bonus mom.\""
  },
  {
    "id": "1121",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Remember getting praised for small victories? Think about the fact that at one point, someone actually congratulated you for going to the bathroom and finishing all your dinner. If girls that exhibit masculine tendencies are praised for their strength while boys that display more feminine interests are rejected, what are we teaching children about gender? At a young age, we are already showing children that traditionally feminine characteristics aren't valuable. Life can be scary. We learn that at an early age. You learn that the first time you think there is a monster in your closet I'm 19, and am in no way planning on having kids any time soon (so you can breathe a sigh of relief, Mom). But I'm excited to meet you kiddos one day. I'm also scared that I won't live up to your expectations or mine. I can, however, promise you these 10 things though, and for now, I think that's pretty good. Every day you tend to learn something new. It can be a small thing you heard while eavesdropping at the hairdressers or it"
  },
  {
    "id": "1136",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Rohit Chopra is one of the toughest consumer advocates in Washington. \"It's the one form of bigotry that is still allowed in America, and that's bigotry against the successful.\" They're backing a bill to undermine the Consumer Financial Protection Bureau. The bankers behind the last one still have their get-out-of-jail-free cards. Rohit Chopra, a Trump appointee to the Federal Trade Commission, took a not-so-subtle jab at the tech giant."
  },
  {
    "id": "11688",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The path of least resistance would be for her to resign. The Rowan County clerk is expected to remain incarcerated for at least a week. The businessman says allowing one of his employees to express her gender identity \"would be violating God’s commands.\" But the Virginia school board would be fine if it took a little longer. A clear majority of people would like to see the 2010 ruling overturned."
  },
  {
    "id": "11244",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Most of the countries on the new list are still Muslim-majority, said Becca Heller, IRAP's director. The new countries it includes are just a way to cover up the fact that the ban still primarily targets Muslims, experts said. The new order leaves out many of the most forceful points from the original one. But tens of thousands will still be affected. These are some of the most inspiring athletes coming to Rio. She also said she thinks she's one of the most bullied people in the world."
  },
  {
    "id": "11388",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The icon shared the news of her daughter's birth with a funny little poem. Hayley Booth shared a lovely tribute to her daughter's \"bonus mom.\" The singer shared a too-real conversation she had with her friend. The actor has shared some funny stories and musings about raising three daughters. A mom is honoring her daughter's father, who passed away before she was born."
  },
  {
    "id": "119",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: As well as a time jump and new details about the DiLaurentis family. 😱 \"If somebody says my voice sounds like my dad or my voice sounds like Miley, I take that as more of a compliment.\" The \"Everything, Everything\" star spoke highly of the movie's portrayal of a biracial family. It's a bird! It's a plane! It's ... Harry Styles dangling from a helicopter over the ocean. 😱 Lovato and her new man went to support Joe Jonas at a DNCE concert."
  },
  {
    "id": "11932",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Americans with pre-existing conditions, like Grace, will suffer greatly under the GOP health care plan. In a world rife with war, religious, racial, gender, sectarian, and political strife, when so many children lack safety, enough food, shelter, health care, and education and suffer unthinkable losses of parents to disease, violence, and war, I hope this New Year will bring adults closer to our common sense and moral responsibility for children's well being. The national holiday celebrating Dr. King's birthday is over, but I hope we will heed and act on his 1967 declaration and work to win the first victory right here at home in the biggest economy on earth and end the shame of 14.7 million children being the poorest Americans by ending child poverty now. The new Every Student Succeeds Act begins a new era, but it is one without needed federal accountability and with the hopes that states will fulfill their crucial responsibility to educate all their children fairly and prepare them for work and life. What a terrible irony that in this year of celebration of the Selma marches we are witnessing the resurgence of overt law enforcement brutality and injustice in Ferguson, Cleveland, New York City, and elsewhere, reminding us how far we still have to go. The continuing protests against unequal justice under the law by those enjoined to protect all of us and all of our children after the deaths of teenager Michael Brown, 12-year-old Tamir Rice, and others are a wake-up call about the deeply embedded systemic racism still alive in America. Each of us has a responsibility to root it out and stop it in its tracks."
  },
  {
    "id": "11739",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: She and the other women on the Supreme Court were on fire. Both were on the president's short list for the Supreme Court. Garland ultimately got the nod. \"My comments were inappropriately dismissive and harsh,\" the Supreme Court justice said. The NAACP and other national groups are expected at the gathering. In a Senate hearing, the Supreme Court nominee said it was discouraging when \"anyone\" impugns the integrity of those on the bench."
  },
  {
    "id": "1198",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Mayor Bill de Blasio calls the decision “a fitting path for a girl who refuses to quit.” “No one who votes for this tax bill will be voting with your life in mind. But you will pay for it.” Jessica Chastain, James McAvoy, Isaiah Mustafa and Bill Hader assemble for the Stephen King sequel. The \"View\" co-host defends the figure skater's decision to turn down the invitation. The decision follows multiple pet-related mishaps, including the death of a puppy."
  },
  {
    "id": "11406",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: From lip balm to a bullet journal to a selfie stick. “Please don’t expect too much from me as a newborn baby, or too much from yourselves as parents.\" The highly politicized speech has been described as a break from tradition for the non-partisan organization. From the palace to the streets, quilted jackets are the perfect fall outerwear. Google Trends data from March 2020 to the present shows what people across the U.S. are drinking the most."
  },
  {
    "id": "11516",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: GOP politicians have been questioning the integrity of the nation's premier law enforcement agency in an effort to undermine the Mueller probe. #ReleaseTheMemo is the latest way Republicans on Capitol Hill are trying to undermine the Mueller probe. The agreement between DOJ and the St. Louis suburb requires an overhaul of their law enforcement agency and municipal court system. The Alabama Republican and Trump supporter is still almost certain to be confirmed as the nation's top law enforcement official. The bureau says the memo Republicans have used to undermine Mueller has “material omissions of fact that fundamentally impact the memo’s accuracy.\""
  },
  {
    "id": "11952",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The Montana governor and Democratic presidential candidate slammed Ken Cuccinelli for championing the administration's \"public charge\" policy. The Democratic presidential contender's lawyers demanded that Clinton issue a retraction for calling an unnamed candidate \"the favorite of the Russians.\" The 2020 Democratic presidential candidate said when her shot went awry, the bird \"appeared to perish.\" The 2020 Democratic candidate is using the president's reported interest in acquiring the island to fundraise for his own campaign. The congresswoman took aim at a new ad in which the Democratic candidate criticizes proposals from Sanders and Warren."
  },
  {
    "id": "11315",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: But do we really want to take nutrition advice from a 19th-century poet anyway? She's drawn a ton of backlash, but how different are her actions from what many people do every day? A new study had important findings for women, but all we heard about was \"man flu.\" “We are determined to take our country back,\" Duke said. \"We are going to fulfill the promises of Donald Trump.\" We discuss what it all means on \"Talk Nerdy To Me.\""
  },
  {
    "id": "1177",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The star of \"The Crown\" revealed the very funny and relatable information during an Instagram Live Q&A with fans. The “WandaVision” star offered fans a glimpse of the couple’s sweet and funny dynamic. The “WandaVision” star made the bizarre claim during a lie detector test — and passed. The “Bohemian Rhapsody” star also said his experience working with the director during the Oscar-nominated film “was not pleasant.” It seems the “Dune” star has found a very interesting way to entertain himself."
  },
  {
    "id": "11948",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The ex-CIA director gave a blistering defense of the former Senate majority leader. The former director of national intelligence said Trump's reported ordering of a top-secret clearance for Jared Kushner sets \"a terrible example.\" The House speaker demanded that the White House brief lawmakers on the operation, which led to the death of the ISIS leader. The former Nevada lawmaker suggested the former vice president's response to her allegations showed a lack of awareness. The former vice president said the congresswoman hasn't had as much of a progressive impact as reporters suggest."
  },
  {
    "id": "11275",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Perhaps we are lazy and prefer not to leave the neighborhood, but I prefer to think that we simply have so many great places to eat that we need not go far. If it is true we are sleepwalking into a depression worse than we have known before, we must wake up quickly. But the best part was where I stayed, Brody House , and the lovely men who own it and, when not in London, Saint Petersburg The memorial tribute gathering of friends and colleagues during IDFA allowed everyone the chance to write in a memorial book, their memories and caring thoughts for Peter's family.  At the vent, buttons were handed out which read, \"Peter-King of Docs.\" The vibe at the Sheffield Doc Fest is simply fantastic.  The city itself welcomes filmmakers, commissioners, composers and producers from all over the world, and gives back warmth and appreciation for their work."
  },
  {
    "id": "11823",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “We need people who are going to support the America First agenda, and I will be that person,” Danny Tarkanian said. \"Now that I’m an adult and I look back, I see things that I didn’t see then,\" Elizabeth Flores said. \"If I were to run a campaign that I could be proud of ... I could not win in a Republican primary.\" \"If you really do want the truth you need to put people under oath,\" the chairman of the House intelligence committee said. Kerry Washington, Reese Witherspoon and America Ferrera are just a few of the A-listers involved."
  },
  {
    "id": "11120",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The “Zoey 101” star’s posts seem to be about Britney Spears’ conservatorship. The country superstar got in on the red flag meme, in which a user posts a warning sign about someone’s character and follows it up with red flag emojis. “Getting sexually harassed seems to be a constant, but having the opportunity to do something about it is rare,” the “Broad City” creator wrote on Instagram. The TikTok star’s mom Sheri Easterling and the “Betty” rapper made their romance public — but her ex, Monty Lopez, is not happy about it. The “Empire” star’s NFL boo took a knee and popped the question. 💕"
  },
  {
    "id": "11734",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: How an Asian-American band's trademark battle aims to reclaim derogatory names -- and the First Amendment. An appeals court ruled that a trademark provision that prohibits disparaging names violates the First Amendment. And what that tells us about the decline of the government lawyer -- and the law itself -- in the context of national security. \"Justice Scalia nailed all the weak spots -- the 'applesauce' and 'argle bargle' -- and gave me just what I needed to strengthen the majority opinion,\" Ruth Bader Ginsburg said. An often-forgotten battle for free speech rights started when the activist took a stand to take his seat."
  },
  {
    "id": "11702",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The move is among measures to combat questionable court practices. But there's still more to be done. The commonwealth is \"sovereign,\" sure, but still highly dependent on Congress. Judge Jane Kelly is still available, should the next president be listening. Among the new names is Sen. Mike Lee, who quickly said thanks, but no thanks. The state must adopt a number of measures to ensure no Texan is disenfranchised in the November election."
  },
  {
    "id": "1163",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “You would do this for me and I would do this for you.” \"I genuinely do not understand how America can be this disorganized or this hateful.” \"I always knew I would lose a piece of me when he left us. I feel the hole now.\" “So many people just drive by … I challenge them to do the same.” “No one who votes for this tax bill will be voting with your life in mind. But you will pay for it.”"
  },
  {
    "id": "11522",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: To that end, Fashion Whip has three wishes we'd love to see granted by Ann Romney. While this may sound trivial, the fact Expect to see a lot more of this before Election Day. The GOP nominee said he gets his exercise by waving his hands around while talking. The notion that he deserves special recognition for addressing Clinton by her title is pretty laughable. Summer Zervos is the 11th woman this week to come forward."
  },
  {
    "id": "11514",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “The last time I went to a book release was Harry Potter.” “The president was going to fire him last spring and I went to his defense,” Grassley says of the attorney general, who wrote in opposition to a bipartisan bill. “I made a determination that I believed that it was unlawful. I also thought it was inconsistent with the principles of the Department of Justice. And I said no.\" \"I just didn’t want to say what I was going to say.” The decision follows a hung jury last year and an acquittal on other charges last week."
  },
  {
    "id": "11834",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “Everything everybody seems to know, we didn’t know,” James Snead said of the 19-year-old. The 43rd president spoke out about the need for a free press, but later said he didn’t mean to criticize his successor. “If we allow the government to shut down speech for some, we all will pay the price down the line.\" “I didn’t come to Washington to roll over and play dead,\" the U.S. senator from Massachusetts said. Trump's attorney says the $130,000 payment didn't violate campaign finance laws. Kellyanne Conway's husband seems to suggest otherwise."
  },
  {
    "id": "11284",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The NBC anchor was not going to let Billy Bush go soft on Lochte. The author of a new book on the Bush presidents revealed some of their true thoughts on Trump. The former Trump aide’s “everyday carry” did NOT go unnoticed by Twitter users. The people there are going to \"stand up stronger and say no.\" The model was set to guest star on the second season of the Netflix show."
  },
  {
    "id": "11957",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Williams testified in the impeachment probe that Trump's July phone call with the Ukrainian president was \"unusual and inappropriate.\" The president's GOP rival said Trump's phone call with Ukraine goes beyond \"undermining democratic institutions.\" Trump's personal attorney is doubling down on his defenses of the president as both are ensnared in an escalating House impeachment probe. Trump said the president had nothing to do with the matter. The White House economic adviser asserted that Trump could legally demand that private companies cut ties with China."
  },
  {
    "id": "11645",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Some of the most important struggles of the ’60s and ’70s, like civil rights, are still underway today. With deaths and destruction still being assessed, the California wildfires are bringing us close to the costliest year on One of the longstanding and unsettled arguments in civil society is whether skepticism is a virtue or a vice. Skepticism Some of the fireworks we can expect to see in Washington, D.C. soon will have nothing to do with the Fourth of July. They America’s quadrennial ordeal to pick a president is like a very long job interview. The political parties sort through the"
  },
  {
    "id": "11789",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The hosts of MSNBC's \"Morning Joe\" asked the EPA head nine times before he gave an answer. \"What trash are you speaking?\" Adrian Richard Vergara reportedly asked the teen refugee before attacking him on a trolley. \"A disruption of the school will not be tolerated,\" says the head of the Needville Independent School District. The \"Cosmos\" host said he welcomes an independent investigation into the allegations. The White House press secretary refused to give a yes or no answer."
  },
  {
    "id": "11792",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The \"Fahrenheit 11/9\" director also said Americans should expect the \"evil genius\" to be re-elected in 2020. Harold Frazier said Trump should also apologize to the nation for his Pocahontas remarks. The four-term GOP incumbent has drawn several Democratic challengers in what promises to be one of the most-watched races in 2020. The high-profile attorney said \"basic fairness and decency\" dictates that her client should be able to speak out. The mind of a \"very stable genius\" works in mysterious ways, apparently."
  },
  {
    "id": "1172",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Twitter users exercised their right to mock the Georgia Republican after she posted a video of herself doing a CrossFit-style workout. The artist shared a preview of his shocking video on Tuesday. The New York Times columnist wrote a lengthy apology to the famous women on Twitter after her inflammatory comments about them went viral. Many people on Twitter criticized the first look of the actor's Genie on the cover of Entertainment Weekly. On the eve of his inauguration, the president-elect delivered a heartfelt goodbye speech to Delaware on a location named after Major Beau Biden."
  },
  {
    "id": "11683",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Alfredo Prieto was executed Thursday night. The justices responded on Friday. Citing religious reasons, the clerk filed an emergency request with Justice Elena Kagan on Friday. The case is one of many the court heard while Justice Antonin Scalia was still on the bench. The lawsuit was dead on arrival. But it made a good point. Mike Pence was on the Hill on Wednesday looking for Democratic senators to get behind Trump's eventual choice."
  },
  {
    "id": "11259",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: He's probably talking about the owners who have criticized him and backed protesting players. He endorsed Trump -- the man who called his father \"stiff\" and \"low energy\" -- in 2016 and has supported him since. The senator, who once employed Porter, explained why he defended him against domestic abuse allegations. Several Klan members were arrested this weekend after stabbing three people who were protesting their rally. He's been giving the same responses to questions over and over again, but he has no intention of stopping."
  },
  {
    "id": "11701",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: You can't be prosecuted for uploading a selfie while you cast your vote. The nominee said you may overrule precedents only \"in very few cases.\" The so-called \"provocation rule\" can't be used against police officers in excessive force cases. The court was open for business while most of Washington wasn't. Dow Chemical settled a price-fixing lawsuit because it lost the late justice's vote."
  },
  {
    "id": "11161",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The singer returns to her roots with her new album, \"Be Myself.\" The country singer dishes on the emotions she poured into her new album, \"Unapologetically.\" The singer gets real about her new album, Ja Rule and staying relevant. The singer tells HuffPost she's in the best place of her life. The former teen heartthrob, now 30, returns with new music for the first time in four years."
  },
  {
    "id": "111016",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: If the president was ever serious about big infrastructure spending, now's the time. If ever there were an impeachable offense, selling out national security for your business interests has to top the list. Norway, like the U.S., is currently facing a serious backlash against immigration. What is Elizabeth Warren up to? Elizabeth Warren's offhand remark in an interview with People magazine strongly suggested that the Massachusetts senator has revised her previous firm declarations of non-candidacy for president and is now deliberately leaving the door open a crack. Asked whether she was considering a run in 2016, Warren said disarmingly, \"I don't think so,\" but added, \"If there's any lesson I've learned in the last five years, it's don't be so sure about what lies ahead. There are amazing doors that could open.\" That sure opened one door. Is Warren really thinking about challenging frontrunner Hillary Clinton? I'd be surprised if Warren has made any decision on that question, but her remark immediately set off two kinds of political waves. When you consider what has been happening to the average working person since the era of Ronald Reagan, it's amazing that the Republicans have fought the Democrats about to a draw. The recipe of Reagan and both Bushes has been to weaken government, undermine the regulation of market excesses, attack core social insurance programs, tilt the tax system away from the wealthy and towards the middle class, gut the safeguards that protect workers on the job, make college ever more unaffordable, and appoint judges who undermine democracy itself. That stuff is not exactly popular. Yet Democrats seem largely unable to convert Republican elitism to their advantage."
  },
  {
    "id": "111004",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Portraits in Leadership unveiled by Girl Scouts in December, features interviews of sitting members of Congress who discuss their thoughts on leadership. These Senators and Representatives vividly demonstrate that some leaders are born women. Many historical women whose accomplishments we are aware of today had to battle society's perceptions of women's proper place. Some women were fortunate enough to have the support of a man in their endeavors -- the \"He for She\" paradigm Emma Watson recently spoke of at the U.N. Today, we are able to exercise our religious beliefs because of the courageous women and men who came before us.  Let's learn about some of the women who strove for religious freedom. I recently attended meetings and award events at the University of Colorado at Boulder and the University of Virginia. As always happens when I am on a college campus, I was struck by the importance and value of education. The following women are among the 15 candidates that you can vote on to be the face on the $20 bill. All 15 have been inducted into the National Women's Hall of Fame"
  },
  {
    "id": "11349",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: This photographer wants to remind the world that \"fed is best.\" \"I want people to know that this is what motherhood looks like.\" Amy Purling wants to help \"make this scary time a little bit brighter.\" And this video of a girl trying to go down it is beyond hilarious. The host responds to the CDC's finding that teen drinking is at a 25-year low."
  },
  {
    "id": "11400",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “It’s hard to be a really good mom and a really good person at your job.” Four-year-old Evie really wants her new sibling to be named Batman. The expectant parents really wanted him to be part of the moment. The meaning of \"treat yourself\" really changes after you have kids. “It’s beautiful, it’s very emotional, and it brings you and your wife closer together.”"
  },
  {
    "id": "11463",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Attorneys argued the Trump-backing trio were radicalized by “chaos news,” and wrongfully targeted by the feds for “locker room talk.” Justice Department alums from both sides of the aisle were alarmed by the president's comments this week. By comparing his case to Hillary Clinton's, a Navy sailor and his lawyer were able to grab Fox's attention — and the president's. At an event attended by officers' families, the president denounced MS-13 and called for the death penalty for those who kill police officers. In 1984, a Republican celebrity president was under attack by the media elite, and the future deputy attorney general wasn’t going to stand for it."
  },
  {
    "id": "11274",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: I've always wondered how our family portrait would ever be complete. How do I honor my three without my three here on earth? And then some photos from a few photographers starting showing up on my social media, a result of how much coverage Pregnancy and Infant Loss Awareness Month is getting this year. Never could I have imagined I would find myself, my home and my destined chosen family all from a woman I met online. If you stay silent, I can pretty much guarantee it will be difficult to find the support and love you will so need in this lifelong journey of loss and recovery. Thank you for your realism that this doesn't always work. Without even knowing it, you had my back in that interview. Thank you for supporting what needs to be the message. I think we must figure out how we can we give ourselves, and others, permission to mourn their should have beens. Can we give ourselves, and others, permission to feel it all -- the blessings, the lucky, the anger, the sadness, the guilt, and even, the shame?"
  },
  {
    "id": "11807",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The four-term GOP incumbent has drawn several Democratic challengers in what promises to be one of the most-watched races in 2020. The \"Fahrenheit 11/9\" director also said Americans should expect the \"evil genius\" to be re-elected in 2020. The GOP lawmaker and vocal Trump critic has been accused of not personally doing enough to keep the president in check. The president-elect's office said Biden would likely be in a walking boot for several weeks. \"We are just students who want to be safe in our schools,\" said a 17-year-old organizer of one of the forums."
  },
  {
    "id": "11214",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: She plans to get the required number of petition signatures to make it onto the ballot. She plans to spend her summer visiting young women around the world. They are meant to represent the number of children killed in shootings since Sandy Hook. She also said she thinks she's one of the most bullied people in the world. \"People don't die of Zika, people get it and they don't know they have it.\""
  },
  {
    "id": "11917",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The senator earned respect from both sides of the aisle, and tributes from the likes of Barack Obama, Bernie Sanders and Paul Ryan are proof. The lieutenant governor faced rebuke from Sens. Kamala Harris and Bernie Sanders, as well as all of Virginia's House and Senate Democrats. Tweeting from Japan, Trump told the North Korean dictator he wanted to meet at the border zone while he was in South Korea for a meeting with President Moon. Trump launched into a tirade against Democrats as the House voted to impeach him over abuse of power and obstruction of Congress. The longtime conservative will not be seeking reelection at the end of his fourth term."
  },
  {
    "id": "11912",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: At least five deaths so far have been linked to Florence, now a tropical storm. Meanwhile, the president continues to rant about last year's disaster. Facebook CEO Mark Zuckerberg said last week he didn't know about the PR campaign until The New York Times investigation. The company is revamping its guest standards and banning open-invite parties across the app after a shooting at a San Francisco rental left five people dead. Even his colleagues at the Times criticized the conservative writer for citing a paper by a researcher who has been labeled a white supremacist who promoted eugenics. Recent reports have described a stifled relationship between Azar and President Trump. Now, Azar may be on the cutting block."
  },
  {
    "id": "11137",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “It hasn’t hit me,” Graham told HuffPost about the series' end. The singer tells HuffPost she's in the best place of her life. The singer turned music executive was the voice behind the 1990 hit \"I'll Be Your Everything.\" \"Love Shack\" became a hit nearly 30 years ago. Singer Kate Pierson reveals how the song came to be. Could Donald Trump bring David Crosby, Stephen Stills, Graham Nash and Neil Young back together?"
  },
  {
    "id": "11598",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: \"We need EMS... we have a report of a firearm... firefighter shot.\" After a report of shots fired, the center encouraged people to \"run, hide or fight.\" \"We could not be prouder of this delegation of young women who are also scientists,\" a U.S. official said. \"This was not an active shooter situation. We realized that when we got on the scene.\" Many of the state's school districts have shut down through the end of the week."
  },
  {
    "id": "11445",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Do you have a copy of this video? Please get in touch. \"Do you think Hillary would be able to stand up here for an hour and do this? I don’t know. I don’t think so.\" \"Does anybody on this panel have any evidence at all, any reason to believe that there were 3 million fraudulent votes cast in this election?” *Crickets* \"More people have died in this country in attacks by domestic extremists than in attacks associated with international terrorist groups.\" There was a lot of news in April 2018. See what you forgot about."
  },
  {
    "id": "111000",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: B.A.F.T.A. (British Academy of Film and Television Arts) held their high pre-Emmy tea Saturday afternoon at the luxurious SLS hotel.  This industry party continues its solid draw as a talent magnet, with many notables of the red carpet and at the exclusive party beyond. Bringing style to spare the end is an emotional one, surprising and kicks you in the gut all at the same time.  I found Looper a great ride that delivers on its promise of being  something new. The magic of GHOST, both the film and musical production, is the chilling sensation you get watching the hero fight for the woman he loves from beyond the grave.  It keeps you on the edge of your seat. Fashion Week in Los Angeles had an explosive start with Art Hearts Fashion bringing 30 of the most anticipated designers of the season under the same roof for the first time. Quincy Jones received the Herbie Hancock Humanitarian award from Herbie Hancock himself at the Thelonious Monk Institute's International Jazz Vocals Competitions Award Gala at the Dolby Theater in Hollywood last Sunday night."
  },
  {
    "id": "111004",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Portraits in Leadership unveiled by Girl Scouts in December, features interviews of sitting members of Congress who discuss their thoughts on leadership. These Senators and Representatives vividly demonstrate that some leaders are born women. Many historical women whose accomplishments we are aware of today had to battle society's perceptions of women's proper place. Some women were fortunate enough to have the support of a man in their endeavors -- the \"He for She\" paradigm Emma Watson recently spoke of at the U.N. Today, we are able to exercise our religious beliefs because of the courageous women and men who came before us.  Let's learn about some of the women who strove for religious freedom. I recently attended meetings and award events at the University of Colorado at Boulder and the University of Virginia. As always happens when I am on a college campus, I was struck by the importance and value of education. The following women are among the 15 candidates that you can vote on to be the face on the $20 bill. All 15 have been inducted into the National Women's Hall of Fame"
  },
  {
    "id": "1176",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The comedian says a woman  who quit performing comedy after an encounter with Louis C.K. had a “brittle-ass spirit.” Quincy Jones and Jennifer Pryor Lee said earlier this week that the comedian and actor had had sex. Adam Venit, who Crews says groped him at a party in 2016, is back at work after a one-month suspension. Chris Rock wasn’t the only comedian at the Academy Awards who made a joke that led to a truly awkward moment. She and her husband had an Oval Office strategy, according to a new tell-all book about the White House."
  },
  {
    "id": "11672",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: An appeals court wiped out an earlier ruling that was seen as a boost to gun rights advocates. An appeals court would not throw out the contempt order that put Davis in jail for refusing to issue marriage licenses. Ken Paxton, the state attorney general, has asked an appeals court to reconsider a ruling against the travel restrictions. An appeals court found that the restrictions harked back to the Jim Crow era. An appeals court ruled that a trademark provision that prohibits disparaging names violates the First Amendment."
  },
  {
    "id": "11778",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: President Donald Trump's daughter scolded NBC's Peter Alexander for asking her about the numerous accusations against her father. \"I've wasted enough of my viewers' time,\" the CNN host told President Donald Trump's senior policy adviser. The Utah senator is one of the first Republicans to call for more information about Trump's dealings with Ukraine President Volodymyr Zelensky. The pop music icon said her comments about “blowing up the White House” were taken out of context. The Republican senator did not disclose details about the accusations per \"the wishes of those victimized.\""
  },
  {
    "id": "11414",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Apparently, Julie Bowen is going to play a judgmental rival mother. Doctors told him he would never be able to play football. \"Join your friends outside and play in snow pants pants pants.” \"Why is walking to the bathroom in a restaurant so embarrassing\" \"The first step to putting an end to bullying is to take a stand against it.\""
  },
  {
    "id": "1192",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “The Good Place” star said she and husband Dax Shepard were in need of “a little marriage house cleaning\" when they “started quarantine.” The actress revealed she was labeled “unruly” and “a nightmare” when she called out the director's comment. \"Make sure the other person is not just willing, but damn well enthusiastic,\" wrote “The Good Place” star. “They were like, ‘I think you need to come in for this.’” “She said she missed when she would go out with her girlfriends and get dressed up!”"
  },
  {
    "id": "11304",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The author of a new book on the Bush presidents revealed some of their true thoughts on Trump. The NBC anchor was not going to let Billy Bush go soft on Lochte. The \"Full House\" star revealed one big clue that the musician was singing about him on her \"Jagged Little Pill\" album. The model was set to guest star on the second season of the Netflix show. A 70-year-old woman is accused of sprinkling ricin on the food of other seniors."
  },
  {
    "id": "11713",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The Obama appointee had hard-hitting words for those who may feel hopeless about the president-elect. The president and first lady were among those who paid their respects. Missouri can’t keep secret the names of those who provide it with pentobarbital, a deadly anesthetic. Under the Constitution, those sentenced as minors to mandatory life imprisonment without the possibility of parole may get a new day in court. His vision for the Supreme Court and the Constitution is ... complaining about a sitting justice."
  },
  {
    "id": "11522",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: To that end, Fashion Whip has three wishes we'd love to see granted by Ann Romney. While this may sound trivial, the fact Expect to see a lot more of this before Election Day. The GOP nominee said he gets his exercise by waving his hands around while talking. The notion that he deserves special recognition for addressing Clinton by her title is pretty laughable. Summer Zervos is the 11th woman this week to come forward."
  },
  {
    "id": "1139",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Lawmakers have passed a bill to roll back regulations adopted after the 2008 financial crisis. Big banks have blown $157.4 billion buying up their own stock since the financial crisis. They're backing a bill to undermine the Consumer Financial Protection Bureau. And just a few days ago, he flubbed the history of the financial crisis. Seven years after the financial crisis, the Republican Party has finally found its populist champion, and his name is Donald"
  },
  {
    "id": "11591",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: There were 130 people killed that day. Trump used finger guns to replay the massacre. Obama's plan would close the gun show loophole that allows people to buy guns without a background check. The information, officials told CNN, could get people killed if leaked. Eight people told CNN that they were victims of harassment and inappropriate behavior by the actor. The 27-year-old from Maryland took her first steps since the massacre."
  },
  {
    "id": "11732",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: What will happen to them will be a test for the Supreme Court. Neither candidate said what he or she plans to do with the Supreme Court. Whether the three-judge panel agrees to go along could be an early test for the president's authority. The law and the politics of justice will never be the same. The president's beleaguered executive order won't be reinstated, and will remain stuck in the courts for a while."
  },
  {
    "id": "11714",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Only children \"whose crimes\nreflect permanent incorrigibility\" may be given a life sentence without parole, the court said. Under the Constitution, those sentenced as minors to mandatory life imprisonment without the possibility of parole may get a new day in court. The \"provocation rule\" only works in one part of the country. The justices may not be willing to let it go further. The nominee said you may overrule precedents only \"in very few cases.\" \"My comments were inappropriately dismissive and harsh,\" the Supreme Court justice said."
  },
  {
    "id": "11650",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: \"To me, it feels like an elephant is sitting on my chest. The worst feeling, where I almost can't breathe.\" The worst truth, though — the truth I hate to admit to myself — is that I see other women as competition. Not having wifi had affected me much less than I imagined. If anything, I felt liberated by the fact that I didn't have to look at my phone so often — because there was nothing to check. Styled the right way — whether that’s with bold colors, sharp cuts, or an oversized fit — it can be as contemporary as you like. Welcome to Money Diaries, where we’re tackling what might be the last taboo facing modern working women: money. We’re asking"
  },
  {
    "id": "11801",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The House speaker reportedly called the White House coronavirus task force member \"the worst\" in a closed-door meeting. The former White House strategist called the infamous Trump Tower meeting \"treasonous,\" according to a new book. The president has been administered dexamethasone as he battles a coronavirus infection, White House physician Sean Conley said Sunday. The former House speaker also suggested the president-elect has the power to pardon advisers who break the law. The \"Today\" co-host poked holes in the White House press secretary's claims about the Russia probe."
  },
  {
    "id": "11244",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Most of the countries on the new list are still Muslim-majority, said Becca Heller, IRAP's director. The new countries it includes are just a way to cover up the fact that the ban still primarily targets Muslims, experts said. The new order leaves out many of the most forceful points from the original one. But tens of thousands will still be affected. These are some of the most inspiring athletes coming to Rio. She also said she thinks she's one of the most bullied people in the world."
  },
  {
    "id": "11149",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The singer-songwriter opens up about collaborating with Ed Sheeran, and why Miranda Lambert is \"the best.\" The \"Lip Sync Battle\" host also opens up about pregnancy and baby Luna. With two Grammys under his belt, the singer-songwriter preps for a new album release. \"The bigger picture is nothing like what you expect,\" the series star told HuffPost. Jess Wolfe and Holly Laessig open up about their second album and unique matching outfits."
  },
  {
    "id": "11340",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: If Watergate was arguably our finest hour, then certainly now is our worst, at least since the Civil War. Today congress is populated primarily (but not exclusively) by Lilliputians and demagogues, who have well earned their abysmal 6 percent approval rating. Americans now have yet another question to ponder. The U.S. has grossly violated international norms of civilized behavior. We have also broken our word.  Why should American's care? Appalled both by the concentrations of wealth enjoyed by the French aristocracy and by their callous exploitation of the poor, Thomas Jefferson proposed an antidote for the fledgling United States: a progressive tax code. At the root of the culture wars lies a fundamental dichotomy in worldviews. Which is more essential to humanity: the individual or the collective? A common public misperception is that tenure perpetuates mediocrity by permitting lifetime appointments for lackluster professors. In practice, the reverse is true: Tenure contributes to hiring the best and brightest."
  },
  {
    "id": "11834",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “Everything everybody seems to know, we didn’t know,” James Snead said of the 19-year-old. The 43rd president spoke out about the need for a free press, but later said he didn’t mean to criticize his successor. “If we allow the government to shut down speech for some, we all will pay the price down the line.\" “I didn’t come to Washington to roll over and play dead,\" the U.S. senator from Massachusetts said. Trump's attorney says the $130,000 payment didn't violate campaign finance laws. Kellyanne Conway's husband seems to suggest otherwise."
  },
  {
    "id": "11493",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Collecting more data is a start, but it might not give the public a better understanding of the problem. James Comey will \"use the bully pulpit of this office to say 'You've got to give it to us, you've got to give it to us.'\" “Age could be very much an issue, and it may not be. It depends on the state of my health and the health of whomever is running.\" But the focus will more likely be on the statistical jump since 2014. “It is extremely important that we make it very public so we can stop it,” the California Democrat said in an interview."
  },
  {
    "id": "11993",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: On the heels of the Senate’s massive tax giveaway to the ultra-rich, the tilt by Mitch McConnell and other establishment I'm puzzled by the claims we've heard in the media all day, triggered by the retreats of establishment conservative senators The department will be on the wrong side of history, the wrong side of justice and the wrong side of our people. Today is the second day of the second round of the Betsy DeVos Department of Education's regulatory meetings to repeal and A filing Monday with the Securities and Exchange Commission by troubled Bridgepoint Education raises questions about the"
  },
  {
    "id": "11365",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Dr. Samantha Decombel says her invitation to give a lecture was revoked due to her pregnancy. Katrina Bolduc was determined to make motherhood work with her athletic dreams. Raelin Scurry was on the way to the hospital when she delivered her son. A mom is honoring her daughter's father, who passed away before she was born. Hayley Booth shared a lovely tribute to her daughter's \"bonus mom.\""
  },
  {
    "id": "11922",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The United States Congress and Trump administration are engaged in a morally abominable massacre of the hopes, dreams and The Trump administration is behaving in ways that will imperil American children for years to come. It is a national disgrace that so many poor children live in the United States of America -- the world's richest economy. It doesn't have to be this way. It's costly. And it's the greatest threat to our future national, economic and military security. Congress must stop playing politics with children and pass four more years of funding for CHIP and MIECHV as part of the \"doc fix\" package if millions of children are not to be left with uncertainty and at greater risk. We need to ensure our children are healthy, supported, and strong if they are going to be able to support our growing number of seniors in the future. Nobody of any age should be held in jail without a trial for three years. No child or adolescent should be held in an adult jail. Yet, a 16-year-old accused of stealing a backpack was kept in one of the most violent adult jails in the United States, Rikers Island in New York City, for three years without a trial. This was morally scandalous and inhumane. Even worse, he spent more than two years of that time in solitary confinement, locked up alone except to go to the shower, the recreation area, the visit room or the medical clinic. This was torture. The suicide of 22-year-old Kalief Browder on June 6, barely two years after his release and return home, was the final horror in his tragic and brutal journey into the depths of the adult criminal justice system in New York."
  },
  {
    "id": "11459",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: While impersonating an Associated Press reporter, an operative failed to use AP style. A draft strategic plan sidelines civil rights while emphasizing a crackdown on leaks and the MS-13 gang. \"Despite cries of pain from Mr. Faulk, the officer continued to press Mr. Faulk’s head against the ground,\" attorneys wrote in the lawsuit. \"More people have died in this country in attacks by domestic extremists than in attacks associated with international terrorist groups.\" Trump's indicted former campaign manager wants to use the condo as part of his bail."
  },
  {
    "id": "11786",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: \"What trash are you speaking?\" Adrian Richard Vergara reportedly asked the teen refugee before attacking him on a trolley. The hosts of MSNBC's \"Morning Joe\" asked the EPA head nine times before he gave an answer. The president reportedly made the comment as acting DNI Joseph Maguire testified about the complaint before the House Intelligence Committee. \"Why wouldn’t you compensate people who actually were property?” the former HUD secretary asked of his fellow 2020 Democratic presidential hopeful. At least 20 heavyweight investors including Amazon’s Jeff Bezos and Virgin’s Richard Branson are pledging their support."
  },
  {
    "id": "11593",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The editorial is in response to a Christianity Today editorial published last week that condemns President Donald Trump. Bannon's exit comes after his quotes in a new tell-all sparked a feud with President Donald Trump. \"We’re heading into a very different summer from last year,\" the president said. \"A bright summer.\" “The one thing that we can say is that this is being treated as a terrorist investigation,” said President Barack Obama. The Arizona senator blasted the memo, which President Donald Trump declassified against the wishes of the intelligence community."
  },
  {
    "id": "11244",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Most of the countries on the new list are still Muslim-majority, said Becca Heller, IRAP's director. The new countries it includes are just a way to cover up the fact that the ban still primarily targets Muslims, experts said. The new order leaves out many of the most forceful points from the original one. But tens of thousands will still be affected. These are some of the most inspiring athletes coming to Rio. She also said she thinks she's one of the most bullied people in the world."
  },
  {
    "id": "11966",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Diana Ross is a diamond. She shines. She's elegant. And she has stood the test of time. It's only fitting her new album release From \"Midnight Blue\" to \"Come in From the Rain,\" Melissa Manchester has written and sung songs that have touched hearts around the world. Now for the first time in 11 years the Grammy Award-winning star is back with a new album called You Gotta Love the Life. Jason Gould's first full-length CD, Dangerous Man, has the big notes and sweeping vocals of a Josh Groban, but if you scratch I caught up with the superstar to talk about her new music, love and why livin' ain't killed her yet. Ian Schrager's trendy office in New York's Greenwich Village is bustling with activity on a humid, late September morning"
  },
  {
    "id": "11939",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: As high-stakes testing becomes even more unpopular, we can also anticipate more of his efforts to pretend that it isn't punitive. But the use of test scores to punish is, by definition, the use of tests to punish. I doubt that Putnam fully realizes how appreciative teachers are of his efforts to shift our toxic education debates to a conversation about the real problem, the opportunity gap. To close the racial and economic achievement gaps, we must regain the confidence required to tackle out-of-school issues as well as in-school issues. Most innovations fail. And like NPR Planet Money's Adam Davidson explains, \"life span of innovations has never shorter, meaning that failure happens more quickly.\" So it is not too soon to start to contemplate of the obituaries of the contemporary school reform movement. We have always had plenty of soul-killing, drill and kill instruction. In the past, however, it was seen as education malpractice. Now, it is imposed in the name of \"reform.\" Rereading Jonathan Kozol's Death at an Early Age on the 50th anniversary of his firing from the Boston Public School System is to be forced to confront the unrelenting horror of school segregation."
  },
  {
    "id": "11256",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “Can you please go get him and bring him to our home? We’ll be waiting for you guys with flags, flowers and balloons.” \"We look forward to him approaching us, shaking our hands, and thanking us for exercising our rights ... in the way he is tasked with supporting,\" the group said. \"He touched me under my clothing and he tried to get me to touch him as well,\" Leigh Corfman said. \"Sorry you have to put up with this,\" Jeff Flake (R-Ariz.) said. \"If you just look at our genome, we are all 99.5 percent the same,\" Clinton said. \"We spend 99 and a half percent of our time fixating on that half of a percent.\""
  },
  {
    "id": "1131",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Debuting here is a \"Track-by-Track\" of Gypsy Runaway Train, the brand new CD from award-winning brother/sister duo The Roys. Get ready to be rur-i-fied by hot vocals, steamin' pickin', unbridled enthusiasm and passion. Buffy's new new album Power In The Blood starts off with the remake of your classic \"It's My Way.\" By kicking off the album with this track, was she making a statement about her creative approach this time out? The one thing we can be sure of is that it will come from some place unexpected and from no one we've ever heard of before. It just doesn't move along in nice, orderly ways. Like everybody else, I feel a lack of social commitment in young artists, but I'm not about to criticize them. The Bottom Line has been closed for eleven years, it closed January 2nd, 2004. I think about it all the time because I spent a great deal of my life there. One of the things I'm working on is an oral history viewed from the perspective of the performers who performed there. MR: Garland, your albums Ghost Writer, which earned you a Best New Artist nod from Rolling Stone, plus the Lou Reed/Rumour"
  },
  {
    "id": "11648",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: When Hidden Figures premiered in theaters this past December, it drew attention to a less discussed issue: The discrimination When you're booking a trip with a foreign carrier, try booking your ticket in the local currency instead of U.S. dollars. We’ve come a long way when it comes to plus-size representation, but we still have a long way to go. With no disrespect to the other fine people working at the Hyatt, this labrador definitely wins the prize for “Most Adorable Employee.” When you're nibbling on your nails, you're also ingesting all the germs your hands have collected throughout the day."
  },
  {
    "id": "11446",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: “I encourage our folks not to get too hung up on ... the noise on TV and in social media,\" said Christopher Wray. “All of us are here as representatives of a democracy that folks on the other side have decided they’re not willing to defend,\" said Georgia's first Black senator. The president said he's careful not to look like he's \"meddling\" in the process, but it's important not to \"operate on incomplete information.\" Prosecutors said the former Reuters social media editor had sought revenge on his former employer. The decision follows a hung jury last year and an acquittal on other charges last week."
  },
  {
    "id": "11830",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: \"It doesn't usually turn out well,\" the MSNBC host said of feces flinging. The \"Cosmos\" host said he welcomes an independent investigation into the allegations. The pop music icon said her comments about “blowing up the White House” were taken out of context. \"It doesn’t matter what’s on my head. It doesn’t matter the color of my skin,\" she said in court. \"We’re fighting for the same rights.\" \"It is clear that I still have much to learn,\" the self-help guru said in a statement Sunday."
  },
  {
    "id": "11821",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The network is facing backlash over its decision not to air commercials that show a lesbian couple kissing. Ximena Barreto remains at the federal agency, but is no longer part of its communications office. The \"Children of the Confederacy Creed\" marker falsely claims that slavery was not an \"underlying\" cause of the Civil War. Rep. Filemon Vela (D-Texas) slammed the president over his response to Friday's mass shooting that left more than 300 dead. Edward Price said the \n\"final straw\" was Trump's decision to add Steve Bannon to the National Security Council."
  },
  {
    "id": "11538",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Press Secretary Sean Spicer insisted that Russia's meddling in elections \"has been investigated up and down.\" Press secretary Sean Spicer also complained about the use of \"unnamed sources.\" Sean Spicer refused to say whether Trump still has confidence in Sessions. Sean Spicer claimed ignorance that the ousted national security adviser was working as a foreign agent, despite warnings. Sean Spicer seemed to contradict himself on whether the administration has a new red line for military action in Syria."
  },
  {
    "id": "1117",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Road tripping is not a mission to take lightly. No matter the destination of your summer trip (because you are taking one Part of growing up is learning that maybe all your dreams won't come true, no matter how hard you work or how much you want them. And an even bigger part of growing up is learning to accept this, move past it -- and, ultimately, find something new to immerse yourself in. I'm 19, and am in no way planning on having kids any time soon (so you can breathe a sigh of relief, Mom). But I'm excited to meet you kiddos one day. I'm also scared that I won't live up to your expectations or mine. I can, however, promise you these 10 things though, and for now, I think that's pretty good. When we remember that these numbers do not confine us, we can start creating the life we want to live. No more limitations. Remember getting praised for small victories? Think about the fact that at one point, someone actually congratulated you for going to the bathroom and finishing all your dinner."
  },
  {
    "id": "11985",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The footage obtained by HuffPost shows a nervous Kelly who failed to press Putin on obvious issues. The women spoke out after HuffPost reported on a shocking set of internal emails filled with misogynistic statements. A woman who was interviewed as part of the company’s HR probe separately told HuffPost that Ford harassed her one evening in Manhattan several years ago. A bipartisan committee will look at successors for the state attorney general, who has resigned in disgrace. Its recommendations might not mean much, though. As his contract nears its end, a renewal doesn't appear to be on the horizon for \"The Last Word\" host."
  },
  {
    "id": "11219",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Several hostages were held in an office near the University of Alabama. Several Klan members were arrested this weekend after stabbing three people who were protesting their rally. An internal investigation found sexual harassment complaints against CEO Wayne Pacelle were swept under the rug. The county's health director, who survived the shooting, relived how the victims held each other as the attackers opened fire. France, the U.K. and Germany have been working with the Trump administration in recent weeks in an attempt to change the president's mind."
  },
  {
    "id": "11548",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: A spokesman for Trump said Le Pen would not be meeting with the president-elect. Visas would be denied to those with \"hostile attitudes\" toward American principles. Those suggesting the attorney general lied during his confirmation hearing should be \"ashamed,\" the White House spokesman said. Rep. Eliot Engel said that for the first time in 29 years, he will not shake the president's hand at a joint session of Congress. Trump later said he would accept \"clear results,\" although he didn't specify what that means."
  },
  {
    "id": "11998",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: By Lily Hay Newman for WIRED. As end-to-end encrypted messaging apps have exploded in popularity, several well-known services By Tim Moynihan for WIRED. Lithium-ion batteries have been making headlines for all the wrong reasons. The latest marquee By Davey Alba for WIRED. Google calls it Project Sand Hill. Since 2012, Suman Prasad and his team have worked with various By Zoë Schlanger for WIRED. I worked for a number of years, like many people, in an office building with windows that did By Klint Finley for WIRED. The Coalition for Better Ads, a consortium of ad, publishing, and tech companies, wants to save"
  },
  {
    "id": "11974",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: By Reverend Rachel Kessler During the 2016 election cycle, Candidate Donald Trump spoke with dystopian fervor about restoring By Reverend Rachel Kessler I have a confession: I am a big fan of hippy progressive Jesus. I like the Jesus I read about By Reverend Rachel Kessler It is probably something of an understatement to say that Wonder Woman is a film that inspired By Maria Behan I’d originally thought about entitling this column “Hillary, Bernie and the Future of the Democratic Party By Annie Mark-Westfall Dear Grandma Bea, Today I told my editor about you. About your letters. She wants to hear more, but"
  },
  {
    "id": "11926",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: What a terrible irony that in this year of celebration of the Selma marches we are witnessing the resurgence of overt law enforcement brutality and injustice in Ferguson, Cleveland, New York City, and elsewhere, reminding us how far we still have to go. The continuing protests against unequal justice under the law by those enjoined to protect all of us and all of our children after the deaths of teenager Michael Brown, 12-year-old Tamir Rice, and others are a wake-up call about the deeply embedded systemic racism still alive in America. Each of us has a responsibility to root it out and stop it in its tracks. As a nation it's time to close our hypocrisy gap in the treatment of our children and value and protect our children -- all of them. We need to examine with urgency how we treat our children and the gap between what we say and what we do. Bryan Stevenson is unwavering in that vision and in lifting his voice of great moral clarity at the forefront of the struggle. Every new hard-earned and overdue victory should remind us all that we must keep moving towards greater justice for all. America is still struggling to live up to its creed enunciated in the Declaration of Independence and overcome its huge birth defects built into the implementation of our political and economic system. Congress must stop playing politics with children and pass four more years of funding for CHIP and MIECHV as part of the \"doc fix\" package if millions of children are not to be left with uncertainty and at greater risk. We need to ensure our children are healthy, supported, and strong if they are going to be able to support our growing number of seniors in the future."
  },
  {
    "id": "11638",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: There's nothing quite like wearing a floaty white dress on a warm summer day. And this season, there are boatloads of good choices, including T-shirt dresses, cocktail-ready options, and sportier versions. Both the dazzling appeal and the sinking horror of being a beauty editor is that a flood of shiny new products wash over your desk each day, free of charge. In spite of it all, you still somehow manage to find the Infallible, the Kryptonite, the Desert-Island-Can't-Live-Without, the One, the Undying. I am thankful that my daughter is getting the treatment she needs, and I’m hopeful that I can help her manage her condition fully and openly. I've known smart women who've gone to extremes to hide the fact that they have to work for their figure. I've been one of them. I once got out of sharing bread pudding on a date by saying that the sight of it made me sad because it was served at my grandpa's shiva. By Lisa Ryan On Wednesday, women around the world will go on strike in observance of International Women’s Day as part of"
  },
  {
    "id": "11504",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: John Martin Roos, 61, repeatedly threatened to kill President Barack Obama in regular racist rants on Twitter and Facebook. At an event attended by officers' families, the president denounced MS-13 and called for the death penalty for those who kill police officers. The FBI arrested 20-year-old Jonathan Xie, saying he donated to Hamas, lied on an application to enlist in the Army, and threatened supporters of Israel. The racist attack on the federal grand jury in D.C. adds to the ways the president's backers are trying to discredit the Russia probe. Gregg Pemberton was quizzed about his use of Twitter by defense lawyers."
  },
  {
    "id": "11517",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: Trump inauguration demonstrators are facing severe felony charges that critics say threaten to chill future protests in Washington, D.C. Los Angeles, Washington, Chicago and Detroit are some of the biggest departments that will receive funding for cameras. Alexei Wood and five others are on trial in D.C. in a case that raises big First Amendment issues. The federal charges against Michael Slager are rare in officer-involved shootings. The U.S. government plans to seek felony convictions for nearly 200 inauguration protesters. The first trial is now underway."
  },
  {
    "id": "1187",
    "input": "Which category does this article relate to among the following categories? Just answer with the category name without further explanation. categories: [women, religion, politics, style & beauty, entertainment, culture & arts, sports, science & technology, travel, business, crime, education, healthy living, parents, food & drink] article: The actress apologized for parts of the op-ed that were interpreted as victim-blaming. “Guardians of the Galaxy” director James Gunn interpreted it for a fan on Twitter. In the past, Jones said that the parents of Sandy Hook victims were actors. The social media company apologized and removed the ad last weekend. The actress complained that a blocked freeway was making her late for her boyfriend’s concert."
  }
]